# 概要：
## 1、 相关模块简介
## 2、 模块安装与技巧
## 3、 相关模块的基本使用

## 1、相关模块简介

1、numpy：基础模块，高效数据处理、提供数组支持
2、pandas：常用模块，数据探索、数据分析
3、matplotlib：作图模块
4、scipy：常用模块，
5、statsmodels:统计分析
6、Gensim：文本挖掘
7、sklearn、keras：机器学习、深度学习

## 2、模块安装
网络安装、注意顺序，以防出错

## 3、模块的基本使用

### Numpy

In [4]:
import numpy as np

#### 创建一维数组格式
numpy.array([元素1,元素2])

In [5]:
x = np.array(["a","b",9,67,2])

In [6]:
x

array(['a', 'b', '9', '67', '2'], dtype='<U2')

In [7]:
x[-2]

'67'

#### 创建二维数组格式
numpy.array([[元素1，元素2]，[元素1，元素2],,,,,]) 两层[]

In [8]:
y = np.array([["a","b"],["2","4","c"],["hello","world"]])

In [9]:
y

array([list(['a', 'b']), list(['2', '4', 'c']), list(['hello', 'world'])],
      dtype=object)

In [10]:
y[1]

['2', '4', 'c']

In [11]:
y[0][1]

'b'

#### 数组排序

In [12]:
import numpy as np

In [13]:
x=np.array([2,69,9])

In [14]:
x.sort()

In [15]:
print(x) #当数组或者列表里含有其他type的值时，则排序不是简单的按照数字大小排序

[ 2  9 69]

#### 取最大值和最小值

In [16]:
y1=y.max()

In [17]:
y1

['hello', 'world']

In [18]:
y2=y.min()

In [19]:
y2

['2', '4', 'c']

#### 切片--取某一片段
数组[ 起始下标:最终下标+1],又叫“左闭右开”

In [50]:
x2=x[1:3]

In [51]:
x2

array([ 9, 69])

In [48]:
y3=y[0:2]

In [49]:
y3

array([list(['a', 'b']), list(['2', '4', 'c'])], dtype=object)

### Pandas
两种数据类型
series：一串数字,index索引
DataFrame：具有行列的series

In [52]:
import pandas as pd

#### series数据的创建
x=pd.Series([数字1，数字2，，，])

In [55]:
a=pd.Series([8,9,2,1])

In [56]:
a

0    8
1    9
2    2
3    1
dtype: int64

#### 指定索引

In [65]:
b=pd.Series([8,9,3,1],index=["one","two","three","four"])

In [66]:
b

one      8
two      9
three    3
four     1
dtype: int64

#### DataFrame数据的创建

In [70]:
c=pd.DataFrame([[1,2,1,3],[12,45,32,56],[1,2,3,90]])

In [72]:
c

    0   1   2   3
0   1   2   1   3
1  12  45  32  56
2   1   2   3  90

##### 指定列名
columns=[]

In [75]:
c=pd.DataFrame([[1,2,1,3],[12,45,32,56],[1,2,3,90]],
               columns=["one","two","three","four"])

In [76]:
c

   one  two  three  four
0    1    2      1     3
1   12   45     32    56
2    1    2      3    90

##### 通过字典创建数据框

In [103]:
d = pd.DataFrame({
        "one":4,
        "two":[6,2,3],
        "three":list(str(982)),
        "four":[10,20,30]
    }
)

In [104]:
d

   one  two three  four
0    4    6     9    10
1    4    2     8    20
2    4    3     2    30

##### head(行数)：调取头部数据，默认前五行

In [105]:
d.head()

   one  two three  four
0    4    6     9    10
1    4    2     8    20
2    4    3     2    30

In [106]:
d.head(2)

   one  two three  four
0    4    6     9    10
1    4    2     8    20

##### tail():调取尾部数据，默认后五行

In [107]:
d.tail(2)

   one  two three  four
1    4    2     8    20
2    4    3     2    30

##### describe(percentils=None,include=None,exclude=None):生成描述性统计，默认只描述前两列
    count:元素个数
    mean：平均数（每列）
    std:标准差
    min：最小值
    max：最大值
    百分位数：百分之多少的值小于此值，
    unique：表示有多少种不同的值
    top：数据中出现次数最高的值
    freq：出现次数最高的那个值（top）的出现频率
   注意：对数字可以完全计数，而字符或者list则不可以，这也是在含有list时，无法对list进行统计的原因。

In [110]:
d.describe()

       one       two  four
count  3.0  3.000000   3.0
mean   4.0  3.666667  20.0
std    0.0  2.081666  10.0
min    4.0  2.000000  10.0
25%    4.0  2.500000  15.0
50%    4.0  3.000000  20.0
75%    4.0  4.500000  25.0
max    4.0  6.000000  30.0

##### 转置
   d.T

In [111]:
d.T

        0   1   2
one     4   4   4
two     6   2   3
three   9   8   2
four   10  20  30